
ax = int(input('Координата х вершины А:'))
ay = int(input('Координата y вершины А:'))
bx = int(input('Координата х вершины B:'))
by = int(input('Координата y вершины B:'))
cx = int(input('Координата х вершины C:'))
cy = int(input('Координата y вершины C:'))

# Вычисляем квадраты расстояний между вершинами
ab2 = (ax - bx)**2 + (ay - by)**2
ac2 = (ax - cx)**2 + (ay - cy)**2
bc2 = (bx - cx)**2 + (by - cy)**2

if (ab2 + ac2) == bc2 or (ab2 + bc2) == ac2 or (bc2 + ac2) == ab2:
    print('Треугольник ABC - прямоугольный')
else:
    print('Треугольник ABC - не прямоугольный')